# Pandas
## Python Data Analysis Library

In a previous session we explored NumPy in detail, learning about array structures and vectorisation. While NumPy is extremely powerful, it has some limitations. For example, data is organised into rows and columns (often in more than 2 dimensions) without labels other than indices. It is really hard to keep track of complex datasets by indexing and slicing alone - we need human-readable labels to make advanced queries and interpret complex results. This is where Pandas comes in - it is an invaluable tool for analysing labelled data. It takes data from csv, tsv, SQL or numerous other sources and converts it into a Python object ordered in rows and columns and persists the row and column labels, which can then be used to query the dataset.

Pandas should already be installed in your conda environment, so we can simply import using the convention:

In [1]:
import pandas as pd

## 1 DataFrames
### 1.1 DataFrame structure

The Pandas dataframe is a structure for storing data in 2D rectangular grids in which each column is a vector containing values for a particular variable. Within a row, there can be different types of data because the dtype is set column-wise and each column is a separate vector. A basic definition of a Pandas dataframe could be:

<b><i>A labelled 2D data structure where each column, but not necessarily each row, contains a single dtype</i></b>

Each value has an index, similarly to a NumPy array, but the Pandas dataframe also has named fields, meaning the data can be queried using names assigned by the user instead of keeping track of indices.

For example, let's instantiate a dataframe named DF with columns named A, B and C, and add some data.

In [2]:
import numpy as np

DF = pd.DataFrame(columns=['A','B','C'])

array1 = np.random.randint(100,size=100)
array2 = np.random.randint(100,size=100)
array3 = np.random.randint(100,size=100)

DF['A'] = array1
DF['B'] = array2
DF['C'] = array3

One important point that you may already have noticed is that the dataframe can accept NumPy arrays. In this case we have provided three 1D NumPy arrays, effectively providing three vectors to become three columns in the dataframe, but we could also have provided a single 2D array:

In [3]:
import numpy as np

array1 = np.random.randint(30,size=(10,3))
DF = pd.DataFrame(array1,columns=['A','B','C'])

Just like with NumPy arrays, we can query the shape and size of the dataframe to understand the data dimensionality...

In [4]:
print("DF shape = ", DF.shape)
print("DF size = ", DF.size)

DF shape =  (10, 3)
DF size =  30

We can peek at the structure of this dataframe using the head() function which reports the top 5 rows of the dataframe to the console. This is really useful for checking quickly, by eye, that the column order, column labels, and dataframe orientation are correct, and that the values are consistent, correctly positioned and within an expected range.

In [5]:
DF.head()

    A   B   C
0  17   6  14
1   8   9   3
2   6  10  10
3  15  20   4
4   2  10  25

We can also do the same for the final 5 rows in the dataframe using df.tail()

In [6]:
DF.tail()

    A   B   C
5   3   2  28
6  26   3  20
7  19  22   9
8  13  14   5
9  17  18  20

We can also quickly access summary info about the dataframe structure using the df.info() function.

In [7]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
A    10 non-null int64
B    10 non-null int64
C    10 non-null int64
dtypes: int64(3)
memory usage: 368.0 bytes

We can access columns using square brackets, similarly to indexing into NumPy arrays, but parsing the column name instead of its position in the matrix. For example, lets extract column A to a new variable. We expect that this will provide us with a vector of integers with a length of 10:

In [8]:
A = DF['A']
print("Shape of A = ",A.shape)
print("dtype = ", A.dtype)
print()
A.head()

Shape of A =  (10,)
dtype =  int64

0    17
1     8
2     6
3    15
4     2
Name: A, dtype: int64

### 1.2 DataFrames from files
In the example above we provided a NumPy array as input to the Pandas dataframe. As a data scientist you will likely need to use data stored externally in files such as .csv or .tsv (comma separated or tab separated values) or perhaps files from Excel or an SQL, NoSQL or MongoDB database, or some other file type. To begin with we will look at csv files. I have downloaded a csv file from Kaggle for this exercise and made it available in the notebook working directory. (https://www.kaggle.com/carlolepelaars/toy-dataset/). The dataset has 6 columns showing population data for 150,000 residents of Dallas, USA. Since it is a dataframe of population data, we'll name it popDF.

In [9]:
popDF = pd.read_csv('./toy_dataset.csv')
print("Population dataframe has {} columns and {} rows ".format(popDF.shape[1],popDF.shape[0]))
popDF.head()

Population dataframe has 6 columns and 150000 rows

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

Rows and columns in Pandas datasets are often referred to differently, especially in the context of machine learning and data modelling. Columns are data "features" while the rows are "instances" of the features.

## 2 Exploratory Data Analysis

Pandas is an excellent tool for exploring a dataset because the dataframe structure promotes complex querying and there are many built in functions for exploration and visualization. 

### 2.1 df.describe()

The data contained within the dataframe can be summarised using the pandas function describe(). This provides summary statistics for each column, including the number of rows (count), the mean, standard deviation, min and interquartile range of the values in that column. Notice that only the columns containing numeric data are included.

In [10]:
popDF.describe()

              Number            Age         Income
count  150000.000000  150000.000000  150000.000000
mean    75000.500000      44.950200   91252.798273
std     43301.414527      11.572486   24989.500948
min         1.000000      25.000000    -654.000000
25%     37500.750000      35.000000   80867.750000
50%     75000.500000      45.000000   93655.000000
75%    112500.250000      55.000000  104519.000000
max    150000.000000      65.000000  177157.000000

Notice that popDF.describe() only returned a summary of those columns containing numeric data. We can force the method to summarise other data types using the "include" keyword argument. In this case, where the operations are only achievable for numeric data types, a NaN is returned. Similarly, some new rows are added that provide summary values for non-numeric data and columns containing numeric dtypes simply return NaNs. These new columns show the number of unique entries in the column ("unique"), the most commonly occurring value ("top") and that top value's frequency of occurrence ("freq").

In [11]:
popDF.describe(include=['object', 'float', 'int'])

,Number,City,Gender,Age,Income,Illness
count,150000.000000,150000,150000,150000.000000,150000.000000,150000
unique,NaN,8,2,NaN,NaN,2
top,NaN,New York City,Male,NaN,NaN,No
freq,NaN,50307,83800,NaN,NaN,137861
mean,75000.500000,NaN,NaN,44.950200,91252.798273,NaN
std,43301.414527,NaN,NaN,11.572486,24989.500948,NaN
min,1.000000,NaN,NaN,25.000000,-654.000000,NaN
25%,37500.750000,NaN,NaN,35.000000,80867.750000,NaN
50%,75000.500000,NaN,NaN,45.000000,93655.000000,NaN
75%,112500.250000,NaN,NaN,55.000000,104519.000000,NaN
max,150000.000000,NaN,NaN,65.000000,177157.000000,NaN

We can also constrain the describe() method to a single column or a set of columns

In [12]:
popDF['Age'].describe() #describe only the Age column

count    150000.000000
mean         44.950200
std          11.572486
min          25.000000
25%          35.000000
50%          45.000000
75%          55.000000
max          65.000000
Name: Age, dtype: float64

In [13]:
popDF[['Age','Income']].describe()

                 Age         Income
count  150000.000000  150000.000000
mean       44.950200   91252.798273
std        11.572486   24989.500948
min        25.000000    -654.000000
25%        35.000000   80867.750000
50%        45.000000   93655.000000
75%        55.000000  104519.000000
max        65.000000  177157.000000

### 2.2 More info

The structural information about the dataframe is accessible using df.info()

In [14]:
popDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 6 columns):
Number     150000 non-null int64
City       150000 non-null object
Gender     150000 non-null object
Age        150000 non-null int64
Income     150000 non-null float64
Illness    150000 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 6.9+ MB

For the non numeric dtypes, we can query the frequency of each unique value in the dataframe using value_counts(), for example, how many instances are there for each city?

In [15]:
popDF['City'].value_counts()

New York City      50307
Los Angeles        32173
Dallas             19707
Mountain View      14219
Austin             12292
Boston              8301
Washington D.C.     8120
San Diego           4881
Name: City, dtype: int64

We can also report these data as proportions of the total rather than absolute count values...

In [16]:
popDF['City'].value_counts(normalize=True)

New York City      0.335380
Los Angeles        0.214487
Dallas             0.131380
Mountain View      0.094793
Austin             0.081947
Boston             0.055340
Washington D.C.    0.054133
San Diego          0.032540
Name: City, dtype: float64

### 2.3 Sorting and reformatting

We can sort the data using the built-in sort function. By default the data is sorted into ascending order (smallest first), to sort into descending order (largest first) we can set the argument ascending = True.

In [17]:
# sort values by income, in descending order, and display the top 5 rows
popDF.sort_values(by='Income', ascending=False).head()

        Number           City Gender  Age    Income Illness
109350  109351  Mountain View   Male   58  177157.0      No
105281  105282  Mountain View   Male   41  176746.0      No
109060  109061  Mountain View   Male   61  173991.0      No
110877  110878  Mountain View   Male   52  173826.0      No
112192  112193  Mountain View   Male   58  172825.0      No

Sorting by multiple columns is also possible. For example, sorting by income (descending) and age (ascending) results in a dataset where the youngest, richest instance is at the top of the dataframe. The algorithm will osrt by income first, then sort rows with matching income by the age. Therefore, the result of sorting by both columns will be identical to sorting only by income *unless* there are rows with identical income values.

In [18]:
popDF.sort_values(by=['Income', 'Age'],
        ascending=[False, True]).head()

        Number           City Gender  Age    Income Illness
109350  109351  Mountain View   Male   58  177157.0      No
105281  105282  Mountain View   Male   41  176746.0      No
109060  109061  Mountain View   Male   61  173991.0      No
110877  110878  Mountain View   Male   52  173826.0      No
112192  112193  Mountain View   Male   58  172825.0      No

We can further demonstrate this by using a non-numeric dtype as one of the sort criteria. For example, if we sort by City first, then income, we will get a dataframe with the residents of each city (alphabetical order) ordered by their income.

In [19]:
popDF.sort_values(by=['City', 'Income'],
        ascending=[True, False]).head()

        Number    City Gender  Age    Income Illness
148778  148779  Austin   Male   42  132302.0      No
147381  147382  Austin   Male   56  131829.0      No
143267  143268  Austin   Male   64  129821.0      No
139728  139729  Austin   Male   53  128569.0      No
138478  138479  Austin   Male   51  127200.0     Yes

It can sometimes be useful to change the dtype of a particular column. We can do this using the built-in .astype() function.

In [28]:
popDF['Number'] = popDF['Number'].astype('float64')   # change Number column to float64
popDF['Number'].describe()  # check result

count    150000.000000
mean      75000.500000
std       43301.414527
min           1.000000
25%       37500.750000
50%       75000.500000
75%      112500.250000
max      150000.000000
Name: Number, dtype: float64